domschl/LugalOS/drivers/sdmmc_esp32p4.c
/* The ESP32-P4's SD/MMC host controller, and the microSD slot the
 * ESP32-P4-NANO wires to it. 35.1-35.5, plan/phase35_esp32p4_sdmmc.md.
 *
 * Provenance, because on this chip it is the whole ballgame (the rule is
 * plan/phase27_esp32p4_bringup.md §3.2, and drivers/emac_esp32p4.c's header
 * says why): every register offset and bit position below was taken from the
 * ESP32-P4 TRM and cross-checked against ESP-IDF's generated headers under
 * ~/gith/esp/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/ -- the
 * hw_ver1 set, because this board is silicon revision v1.3. Where a fact is
 * this board's wiring rather than the chip's, the source is the schematic at
 * ~/gith/esp/datasheet/ESP32-P4-NANO-schematic.pdf and it is named as such.
 *
 * ## Three things about this peripheral that are not obvious
 *
 * **1. The card's power is not a given, and neither is the pads'.** The SD
 * signals live in the VDDPST_5 IO domain, and on this board VDDPST_5 is fed
 * by the chip's own LDO channel 4 (net ESP_LDO_VO4, schematic sheet
 * "MicroSD Card" and the ESP32-P4 symbol's pin 84). The same rail reaches the
 * card's VDD through a 0R link and an AO3401 P-channel switch whose gate is
 * GPIO45. So a driver that configures the controller perfectly and never
 * touches the PMU gets a dead bus with no error anywhere: the pads have no
 * supply. This is what SOC_SDMMC_IO_POWER_EXTERNAL means on this part, and
 * it is why sdmmc_power_on() runs before anything else here.
 *
 * **2. The transfers must be done by the controller's DMA, and the TRM says
 * otherwise.** §57.6 documents a CPU path -- read a block out of
 * SDHOST_BUFFIFO_REG, no descriptors, no cache maintenance -- and this driver
 * was written to use it. It does not work: on this silicon that read returns
 * the head of the FIFO forever and never pops it. The measurements that
 * establish that, and what the DMA path costs instead, are above
 * sdmmc_dma_arm() further down; they are the expensive finding of this phase
 * and they are recorded where the code that pays for them lives.
 *
 * **3. There is no card-detect switch to read.** The socket has one (pin 9,
 * CD) and the schematic pulls it up to SD1_VDD through R10 -- and routes it
 * nowhere. No GPIO sees it. So "is there a card" is answered by asking the
 * card, not by reading a pin, and the controller's own CDETECT input is tied
 * to a constant so that it never refuses a command for a card it cannot see.
 */

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <string.h>

#include "drivers/sdmmc.h"
#include "drivers/driver_task.h"
#include "kernel/printk.h"
#include "kernel/console.h"
#include "kernel/time.h"
#include "arch/esp32p4_intr.h"   /* esp32p4_dcache_* */
#include "lugalos_config.h"

/* Stubbed rather than gated out of CMakeLists.txt's source list, the same
 * shape as drivers/spisd_rp2350.c: fs/vfs_server.c and kernel/board.c call
 * sdmmc_get_device() without a matching #if, and kernel/shell.c's `blkstats`
 * calls blk_task_call_count() the same way. The stubs are at the end. */
#if CONFIG_ENABLE_SDMMC

#define REG(a) (*(volatile uint32_t *)(uintptr_t)(a))

/* --- Peripheral bases (TRM Table 9.3-2, IDF soc/reg_base.h) -------------- */

#define HPPERIPH1_BASE      0x500C0000UL
#define GPIO_BASE           (HPPERIPH1_BASE + 0x20000UL)   /* 0x500E0000 */
#define IOMUX_BASE          (HPPERIPH1_BASE + 0x21000UL)   /* 0x500E1000 */
#define HP_SYS_CLKRST_BASE  (HPPERIPH1_BASE + 0x26000UL)   /* 0x500E6000 */
#define LPAON_BASE          0x50110000UL
#define LP_CLKRST_BASE      (LPAON_BASE + 0x1000UL)        /* 0x50111000 */
#define PMU_BASE            (LPAON_BASE + 0x5000UL)        /* 0x50115000 */

/* --- The card's power rail: LDO channel 4 (VO4) --------------------------
 *
 * TRM §15.4.2.9 ("Output Regulator Control"). Its Table 15.4-3 and Table
 * 15.4-4 are what tie the register names below to VO4 specifically, and they
 * are worth quoting because the mapping is not guessable: the four channels
 * are spread across two register pairs and VO4 is the *_1 half of the 0P2A
 * pair, while VO3 is the *_0 half of the same one.
 *
 *     VO3   PMU_0P2A_FORCE_TIEH_SEL_0 / TIEH_SEL_0 / TIEH_0 / XPD_0
 *     VO4   PMU_0P2A_FORCE_TIEH_SEL_1 / TIEH_SEL_1 / TIEH_1 / XPD_1
 *
 * The TRM's own worked example is this exact case -- §15.4.2.9.2, "Example 2:
 * VO4 powering VDD_IO_5 (SD card voltage switching) [...] 3.3 V output: use
 * bypass mode (for example, set PMU_0P2A_TIEH_1=1)". Bypass, not LDO mode:
 * the rail is already 3.3 V, so the regulator passes it through and DREF/MUL
 * mean nothing. That is also what IDF computes for a 3300 mV request
 * (ldo_ll_voltage_to_dref_mul()'s use_rail_voltage).
 *
 * The register pair is PMU_EXT_LDO_P1_0P2A_REG / _ANA_REG at PMU + 0x1d8 /
 * 0x1dc, which is ext_ldo[4] of the PMU's six -- IDF's ldo_ll.h maps LDO
 * unit 3 (channel 4) through index_array[] to exactly that index, and the
 * TRM's register list names 0x01D8 "VO4 regulator control register" outright.
 *
 * Both bit diagrams were rendered and counted (TRM Registers 15.64 and 15.65,
 * pages 1503-1504), because a wrong bit here is not a peripheral that fails to
 * answer -- it is a voltage on a card:
 *
 *     0x1D8  [30:23] TARGET0_1  [22:15] TARGET1_1  14 TIEH_1  13,12 reserved
 *            [11:9] TIEH_SEL_1  8 XPD_1  7 FORCE_TIEH_SEL_1  [6:0] reserved
 *     0x1DC  [31:28] DREF_1  27 EN_CUR_LIM_1  26 EN_VDET_1  [25:23] MUL_1
 */
#define PMU_EXT_LDO_VO4      (PMU_BASE + 0x1d8)
#define  LDO_FORCE_TIEH_SEL     (1u << 7)    /* 1 = software owns the mode */
#define  LDO_XPD                (1u << 8)    /* 1 = regulator enabled */
#define  LDO_TIEH_SEL_S         9            /* [11:9]; 0 = use TIEH below */
#define  LDO_TIEH_SEL_M         (7u << LDO_TIEH_SEL_S)
#define  LDO_TIEH               (1u << 14)   /* 1 = bypass, i.e. 3.3 V rail */
#define PMU_EXT_LDO_VO4_ANA  (PMU_BASE + 0x1dc)
#define  LDO_ANA_EN_VDET        (1u << 26)   /* ripple suppression */
#define  LDO_ANA_EN_CUR_LIM     (1u << 27)   /* inrush limit, on then off */

