domschl/LugalOS/drivers/sdmmc_esp32p4.c
/* The power switch between VO4 and the card's VDD pin.
 *
 * Schematic: Q1, an AO3401 P-channel MOSFET. Source on the VO4 rail, gate on
 * GPIO45 with R27 (10K) to ground and R23 (the pull-up to the source) NOT
 * FITTED. A P-channel switch conducts when its gate is *low*, so the default
 * state of this board is "SD powered as soon as VO4 is up" and the only way
 * to break it is to drive GPIO45 high.
 *
 * Which is exactly why this driver drives it low explicitly, and does so
 * *before* enabling the regulator rather than after: if the ROM (or anything
 * else that ran first) left GPIO45 as an output driving high, the switch
 * would open the moment the rail it is switching came up, and the symptom
 * would be a card that never answers CMD0 on a board whose PMU registers all
 * read back correctly. */
#define SD_PWR_GPIO             ((uint32_t)CONFIG_SDMMC_PWR_GPIO)

/* --- Clock and reset -----------------------------------------------------
 *
 * Spread across three controllers, exactly like the EMAC's (see
 * drivers/emac_esp32p4.c's own note on this, which is where the shape was
 * first paid for): the bus clock gate is in HP_SYS_CLKRST_SOC_CLK_CTRL1, the
 * module's source select, enable and divider are in
 * HP_SYS_CLKRST_PERI_CLK_CTRL01/02, and the peripheral reset is in LP_CLKRST
 * -- a different peripheral in a different power domain.
 *
 * The one register this file shares with the EMAC driver is that last one:
 * LP_CLKRST_HP_SDMMC_EMAC_RST_CTRL_REG holds both parts' resets, and phase
 * 28 already read its bit diagram (bit 31 FORCE_NORST_EMAC, 30 RST_EN_EMAC,
 * 29 FORCE_NORST_SDMMC, 28 RST_EN_SDMMC). This is the SDMMC half of it. */
#define SOC_CLK_CTRL1       (HP_SYS_CLKRST_BASE + 0x18)
#define  SDMMC_SYS_CLK_EN       (1u << 14)   /* EMAC's is bit 13, right beside it */

#define REF_CLK_CTRL2       (HP_SYS_CLKRST_BASE + 0x2c)
#define  REF_160M_CLK_EN        (1u << 0)    /* reset value 1; written anyway */

#define PERI_CLK_CTRL01     (HP_SYS_CLKRST_BASE + 0x34)
#define  SDIO_HS_MODE           (1u << 22)
#define  SDIO_LS_CLK_SRC_SEL    (1u << 23)   /* 0 = PLL_F160M, 1 = SDIO_PLL 200M */
#define  SDIO_LS_CLK_EN         (1u << 24)

/* The host-side divider, and it is not a plain divisor field: the hardware
 * takes three *edge* numbers (TRM's SDIO_LS_CLK_EDGE_L/H/N) that describe one
 * period of the divided clock, and a write-1 update bit that commits them.
 * For a division by N: N = div-1, L = div-1, H = div/2-1, which is IDF's own
 * sdmmc_ll_set_clock_div(). div == 1 is not expressible that way and has its
 * own bit (SDIO_HS_MODE above); this driver never uses it. */
#define PERI_CLK_CTRL02     (HP_SYS_CLKRST_BASE + 0x38)
#define  SDIO_LS_DIV_NUM_M      0xffu        /* [7:0] */
#define  SDIO_LS_EDGE_UPDATE    (1u << 8)
#define  SDIO_LS_EDGE_L_S       9            /* [12:9] */
#define  SDIO_LS_EDGE_H_S       13           /* [16:13] */
#define  SDIO_LS_EDGE_N_S       17           /* [20:17] */
#define  SDIO_LS_SLF_EDGE_SEL_S 21           /* [22:21] */
#define  SDIO_LS_DRV_EDGE_SEL_S 23           /* [24:23] */
#define  SDIO_LS_SAM_EDGE_SEL_S 25           /* [26:25] */
#define  SDIO_LS_SLF_CLK_EN     (1u << 27)
#define  SDIO_LS_DRV_CLK_EN     (1u << 28)
#define  SDIO_LS_SAM_CLK_EN     (1u << 29)

#define LP_SDMMC_EMAC_RST   (LP_CLKRST_BASE + 0x4c)
#define  RST_EN_SDMMC           (1u << 28)

/* PLL_F160M. Named as a number because it is one: the two-stage divider below
 * is arithmetic on this, and a wrong value here is a card that initialises at
 * the wrong bus clock rather than one that fails. */
#define SDMMC_SRC_HZ            160000000u

/* --- IO_MUX and the GPIO matrix (TRM chapter 10) ------------------------
 *
 * Same register shapes drivers/emac_esp32p4.c documents; repeated here rather
 * than shared because a register half is never shared across drivers
 * (plan/hardware_seams.md §1), and because the pads this file touches are a
 * different set with different requirements.
 *
 * SDMMC **slot 0 has no GPIO-matrix option**: its six signals are IO_MUX pads
 * and nothing else (IDF's SDMMC_LL_SLOT_SUPPORT_GPIO_MATRIX(0) is 0, and
 * soc/sdmmc_pins.h fixes CLK=43 CMD=44 D0=39 D1=40 D2=41 D3=42 at function
 * 0). That is a piece of luck this board cashes in: the Waveshare wiring is
 * exactly slot 0's pad set, so there is no routing to get wrong. Card detect
 * and write protect are the exception -- those are never IO_MUX'd and always
 * arrive through the matrix, which is why the two constants below exist. */
#define IOMUX_PAD(n)        (IOMUX_BASE + 0x4 + 4u * (uint32_t)(n))
#define  IOMUX_MCU_SEL_S        12
#define  IOMUX_MCU_SEL_M        (7u << IOMUX_MCU_SEL_S)
#define  IOMUX_FUN_IE           (1u << 9)
#define  IOMUX_FUN_PU           (1u << 8)
#define  IOMUX_FUN_PD           (1u << 7)
#define  IOMUX_FUN_DRV_S        10           /* [11:10] */
#define  IOMUX_FUN_DRV_M        (3u << IOMUX_FUN_DRV_S)
#define  IOMUX_FUNC_SDMMC       0u
#define  IOMUX_FUNC_GPIO        1u

#define GPIO_IN_SEL(sig)    (GPIO_BASE + 0x158 + 4u * (uint32_t)(sig))
#define  GPIO_IN_SEL_ROUTE      (1u << 7)
#define GPIO_OUT_SEL(n)     (GPIO_BASE + 0x558 + 4u * (uint32_t)(n))
#define  GPIO_OUT_SEL_GPIO      256u
#define GPIO_OUT_W1TS_HI    (GPIO_BASE + 0x14)
#define GPIO_OUT_W1TC_HI    (GPIO_BASE + 0x18)
#define GPIO_ENABLE_W1TS_HI (GPIO_BASE + 0x30)

/* The matrix's two constant sources (IDF soc/gpio_pins.h) and the three
 * per-slot inputs that are never pads on this board. Slot 0's numbers, from
 * IDF's gpio_sig_map.h: SD_CARD_DETECT_N_1 = 126, SD_CARD_INT_N_1 = 128,
 * SD_CARD_WRITE_PRT_1 = 130. */
#define GPIO_MATRIX_CONST_ZERO  0x3Eu
#define GPIO_MATRIX_CONST_ONE   0x3Fu
#define SIG_SD_CARD_DETECT_N    126u
#define SIG_SD_CARD_INT_N       128u
#define SIG_SD_CARD_WRITE_PRT   130u

/* --- The controller itself (TRM chapter 57) -----------------------------
 *
 * A Synopsys DesignWare mobile-storage host, so the register set is the
 * familiar one; the offsets are the P4's, from IDF's sdmmc_reg.h. */
#define SD_BASE             ((uintptr_t)CONFIG_SDMMC_BASE)
#define SD_CTRL             (SD_BASE + 0x000)
#define  CTRL_RESET             (1u << 0)
#define  CTRL_FIFO_RESET        (1u << 1)
#define  CTRL_DMA_RESET         (1u << 2)
#define  CTRL_INT_ENABLE        (1u << 4)
/* Bits 5 and 25. **Not in the P4's generated *_reg.h at all** -- that header
 * stops naming CTRL fields at bit 11 -- but present in its sdmmc_struct.h as
 * `dma_enable` and `use_internal_dma`, and written by IDF's
 * sdmmc_ll_enable_dma() on this exact chip. A field that one Espressif header
 * documents and another omits is worth the sentence. */
#define  CTRL_DMA_ENABLE        (1u << 5)
#define  CTRL_USE_INTERNAL_DMA  (1u << 25)
#define SD_CLKDIV           (SD_BASE + 0x008)   /* [7:0] divider 0 */
#define SD_CLKSRC           (SD_BASE + 0x00c)   /* [1:0] which divider card 0 uses */
#define SD_CLKENA           (SD_BASE + 0x010)
#define  CLKENA_CCLK_EN_0       (1u << 0)
#define SD_TMOUT            (SD_BASE + 0x014)   /* [7:0] response, [31:8] data */
#define SD_CTYPE            (SD_BASE + 0x018)
#define  CTYPE_WIDTH4_0         (1u << 0)
#define SD_BLKSIZ           (SD_BASE + 0x01c)
#define SD_BYTCNT           (SD_BASE + 0x020)
#define SD_INTMASK          (SD_BASE + 0x024)
#define SD_CMDARG           (SD_BASE + 0x028)
#define SD_CMD              (SD_BASE + 0x02c)
#define SD_RESP(n)          (SD_BASE + 0x030 + 4u * (uint32_t)(n))
#define SD_RINTSTS          (SD_BASE + 0x044)
#define SD_STATUS           (SD_BASE + 0x048)
#define  STATUS_DATA_BUSY       (1u << 9)
#define  STATUS_FIFO_COUNT_S    17           /* [29:17], in 32-bit words */
#define  STATUS_FIFO_COUNT_M    0x1fffu
#define SD_FIFOTH           (SD_BASE + 0x04c)
#define SD_CDETECT          (SD_BASE + 0x050)
#define SD_WRTPRT           (SD_BASE + 0x054)
#define SD_RST_N            (SD_BASE + 0x078)
#define  RST_N_CARD_RESET_0     (1u << 0)
#define SD_BMOD             (SD_BASE + 0x080)
#define  BMOD_SWR               (1u << 0)
#define  BMOD_FB                (1u << 1)    /* fixed burst */
#define  BMOD_DE                (1u << 7)    /* the IDMAC's enable */
#define SD_PLDMND           (SD_BASE + 0x084)
#define SD_DBADDR           (SD_BASE + 0x088)
#define SD_IDSTS            (SD_BASE + 0x08c)
#define  IDSTS_FBE              (1u << 2)    /* fatal bus error */
#define  IDSTS_DU               (1u << 4)    /* descriptor unavailable */
#define  IDSTS_CES              (1u << 5)    /* card error summary */
#define  IDSTS_ERRORS           (IDSTS_FBE | IDSTS_DU | IDSTS_CES)
#define SD_IDINTEN          (SD_BASE + 0x090)
#define SD_BUFFIFO          (SD_BASE + 0x200)

/* SDHOST_CMD_REG's fields. The ones this driver does not use (CEATA, CCS,
 * stop/abort, the auto-stop for multi-block) are omitted rather than defined
 * and left unreferenced. */
#define  CMD_INDEX_M            0x3fu
#define  CMD_RESP_EXPECT        (1u << 6)
#define  CMD_RESP_LONG          (1u << 7)
#define  CMD_CHECK_RESP_CRC     (1u << 8)
#define  CMD_DATA_EXPECTED      (1u << 9)
#define  CMD_WRITE              (1u << 10)   /* 0 = read from card */
#define  CMD_WAIT_PRVDATA       (1u << 13)
#define  CMD_SEND_INIT          (1u << 15)   /* the 80 clocks before CMD0 */
#define  CMD_UPDATE_CLK_ONLY    (1u << 21)
#define  CMD_USE_HOLD_REG       (1u << 29)
#define  CMD_START              (1u << 31)

/* SDHOST_RINTSTS_REG. Raw, write-1-to-clear, and set regardless of INTMASK --
 * which is what makes a polled driver possible without ever routing an
 * interrupt (INTMASK stays 0 and CTRL_INT_ENABLE stays clear). */
#define  INT_CD                 (1u << 0)
#define  INT_RESP_ERR           (1u << 1)
#define  INT_CMD_DONE           (1u << 2)
#define  INT_DATA_OVER          (1u << 3)
#define  INT_RCRC               (1u << 6)
#define  INT_DCRC               (1u << 7)
#define  INT_RTO                (1u << 8)
#define  INT_DRTO               (1u << 9)
#define  INT_HTO                (1u << 10)
#define  INT_FRUN               (1u << 11)
#define  INT_HLE                (1u << 12)
#define  INT_SBE                (1u << 13)
#define  INT_EBE                (1u << 15)
#define  INT_CMD_ERRORS         (INT_RESP_ERR | INT_RCRC | INT_RTO)
#define  INT_DATA_ERRORS        (INT_DCRC | INT_DRTO | INT_HTO | INT_FRUN | \
                                 INT_SBE | INT_EBE)

/* --- What this driver remembers about the card in the slot --------------- */

static bool     g_present;        /* a card answered and is initialised */
static bool     g_block_addressed;/* SDHC/SDXC: LBA in blocks, not bytes */
static uint32_t g_rca;            /* the card's relative address, as published */
static uint32_t g_blocks;         /* capacity in 512-byte blocks, from the CSD */
static uint32_t g_bus_width = 1;  /* what the bus actually ended up at */
static uint32_t g_bus_khz;        /* what the card clock actually ended up at */
static uint32_t g_cid[4];         /* kept for `sdinfo` -- who this card is */

/* --- Power ---------------------------------------------------------------
 *
 * The order here is the point; see PMU_EXT_LDO_VO4's comment above for why
 * the switch is settled before the rail it switches.
 *
 * The regulator sequence itself is TRM §15.4.2.9.3's, minus the two steps
 * that only make sense with interrupts (it suggests waiting on the waiting
 * counter's "target reached" interrupts between enabling and dropping the
 * inrush limit). This driver has no interrupts, so it does what IDF's
 * esp_ldo_acquire_channel() does in the same situation: current limit on,
 * mode and owner set, ripple suppression on, XPD, current limit off, then a
 * delay long enough for the rail and the card's own 10 µF to settle. */
static void sdmmc_power_on(void) {
    /* The switch first, and as a plain GPIO output driving low. */
    uint32_t pad = REG(IOMUX_PAD(SD_PWR_GPIO));
    pad &= ~(IOMUX_MCU_SEL_M | IOMUX_FUN_PU | IOMUX_FUN_PD);
    pad |= (IOMUX_FUNC_GPIO << IOMUX_MCU_SEL_S);
    REG(IOMUX_PAD(SD_PWR_GPIO)) = pad;
    REG(GPIO_OUT_SEL(SD_PWR_GPIO)) = GPIO_OUT_SEL_GPIO;
    REG(GPIO_OUT_W1TC_HI) = 1u << (SD_PWR_GPIO - 32u);      /* gate low = ON */
    REG(GPIO_ENABLE_W1TS_HI) = 1u << (SD_PWR_GPIO - 32u);

    /* Then the rail. */
    REG(PMU_EXT_LDO_VO4_ANA) |= LDO_ANA_EN_CUR_LIM;

    uint32_t ctrl = REG(PMU_EXT_LDO_VO4);
    ctrl &= ~LDO_TIEH_SEL_M;               /* TIEH_SEL = 0: TIEH picks the mode */
    ctrl |= LDO_TIEH;                      /* bypass: pass the 3.3 V rail through */
    ctrl |= LDO_FORCE_TIEH_SEL;            /* and software, not eFuse, decides */
    REG(PMU_EXT_LDO_VO4) = ctrl;

    REG(PMU_EXT_LDO_VO4_ANA) |= LDO_ANA_EN_VDET;
    REG(PMU_EXT_LDO_VO4) |= LDO_XPD;
    REG(PMU_EXT_LDO_VO4_ANA) &= ~LDO_ANA_EN_CUR_LIM;

    /* The card's VDD pin has 10 µF + 0.1 µF on it (schematic C7/C8) and the
     * SD physical-layer spec gives a card 1 ms of supply ramp before it will
     * look at anything. 10 ms is that with room to spare, paid once. */
    time_delay_us(10000);
}

/* --- Pads ---------------------------------------------------------------
 *
 * Six IO_MUX pads at function 0, plus the internal pull-ups.
 *
 * The board already fits 51K externals on CMD and D0-D3 (schematic R5-R9,
 * pulled to SD1_VDD), which is weaker than the 10K the SD spec asks for. The
 * internal pull-ups are roughly 45K, so enabling them puts about 24K on each
 * line -- still not 10K, but a great deal closer, and it costs nothing. IDF's
 * own example enables them for the same reason and with the same caveat.
 *
 * CLK is driven by the host at both ends of every edge and wants no pull at
 * all. Every pad gets the strongest drive (3): these are 20 MHz edges into a
 * connector, and the P4's default of 2 is chosen for pins that are not. */
static void sdmmc_pad_init(uint32_t gpio, bool pull_up) {
    uint32_t pad = REG(IOMUX_PAD(gpio));
    pad &= ~(IOMUX_MCU_SEL_M | IOMUX_FUN_PU | IOMUX_FUN_PD | IOMUX_FUN_DRV_M);
    pad |= (IOMUX_FUNC_SDMMC << IOMUX_MCU_SEL_S);
    pad |= IOMUX_FUN_IE;                   /* CMD and D0-D3 are bidirectional */
    pad |= (3u << IOMUX_FUN_DRV_S);
    if (pull_up) pad |= IOMUX_FUN_PU;
    REG(IOMUX_PAD(gpio)) = pad;
}

static void sdmmc_pads_init(void) {
    sdmmc_pad_init((uint32_t)CONFIG_SDMMC_CLK_GPIO, false);
    sdmmc_pad_init((uint32_t)CONFIG_SDMMC_CMD_GPIO, true);
    sdmmc_pad_init((uint32_t)CONFIG_SDMMC_D0_GPIO, true);
    sdmmc_pad_init((uint32_t)CONFIG_SDMMC_D1_GPIO, true);
    sdmmc_pad_init((uint32_t)CONFIG_SDMMC_D2_GPIO, true);
    sdmmc_pad_init((uint32_t)CONFIG_SDMMC_D3_GPIO, true);

    /* Card detect, write protect and the SDIO interrupt line: none of them is
     * a pad on this board (see the file header's point 3), so each is tied to
     * a constant instead of being left at whatever the matrix defaults to.
     *
     * CD is active low, so a constant 0 means "a card is present" -- without
     * it the controller refuses every command with no error this driver could
     * report. WP is active high, so a constant 0 means "not write protected".
     * The SDIO interrupt is constant 1 because that input is
     * ~(int_n | card_int | card_detect) and a 0 there would assert it
     * permanently; this driver never enables the interrupt, but leaving a
     * peripheral input floating on a matrix default is how phase 28's RX pad
     * lists became a warning in the board file. */
    REG(GPIO_IN_SEL(SIG_SD_CARD_DETECT_N)) = GPIO_MATRIX_CONST_ZERO | GPIO_IN_SEL_ROUTE;
    REG(GPIO_IN_SEL(SIG_SD_CARD_WRITE_PRT)) = GPIO_MATRIX_CONST_ZERO | GPIO_IN_SEL_ROUTE;
    REG(GPIO_IN_SEL(SIG_SD_CARD_INT_N)) = GPIO_MATRIX_CONST_ONE | GPIO_IN_SEL_ROUTE;
}

/* --- Clocks -------------------------------------------------------------- */

