domschl/LugalOS/drivers/sdmmc_esp32p4.c
/* The host-side divider: PLL_F160M / div, expressed as the three edge numbers
 * the hardware actually takes. div must be 2..16. */
static void sdmmc_set_host_div(uint32_t div) {
    uint32_t v = REG(PERI_CLK_CTRL02);
    v &= ~((0xfu << SDIO_LS_EDGE_L_S) | (0xfu << SDIO_LS_EDGE_H_S) |
           (0xfu << SDIO_LS_EDGE_N_S));
    v |= ((div - 1u) & 0xfu) << SDIO_LS_EDGE_L_S;
    v |= ((div / 2u - 1u) & 0xfu) << SDIO_LS_EDGE_H_S;
    v |= ((div - 1u) & 0xfu) << SDIO_LS_EDGE_N_S;
    REG(PERI_CLK_CTRL02) = v;
    REG(PERI_CLK_CTRL02) = v | SDIO_LS_EDGE_UPDATE;
    REG(PERI_CLK_CTRL02) = v;
}

static void sdmmc_clk_init(void) {
    /* The module's bus clock, and its reset. RST_EN is 1 = held in reset. */
    REG(SOC_CLK_CTRL1) |= SDMMC_SYS_CLK_EN;
    REG(LP_SDMMC_EMAC_RST) |= RST_EN_SDMMC;
    REG(LP_SDMMC_EMAC_RST) &= ~RST_EN_SDMMC;

    /* The 160 MHz reference this peripheral divides down. Its gate resets to
     * 1, so this write normally changes nothing -- which is exactly the
     * argument drivers/emac_esp32p4.c makes for writing its own always-on
     * gate anyway: a gate nobody writes is a gate nobody notices when
     * something else clears it. */
    REG(REF_CLK_CTRL2) |= REF_160M_CLK_EN;

    uint32_t v = REG(PERI_CLK_CTRL01);
    v &= ~(SDIO_LS_CLK_SRC_SEL | SDIO_HS_MODE);   /* PLL_F160M, divided */
    v |= SDIO_LS_CLK_EN;
    REG(PERI_CLK_CTRL01) = v;

    /* The drive/sample/self clock phases. IDF's sdmmc_ll_init_phase_delay():
     * drive on the falling edge (sel 1), sample and self on the rising one
     * (sel 0). These are the default-speed settings and this driver never
     * leaves default speed -- a DDR or SDR104 mode would have to revisit
     * them, and would have a good deal more to revisit besides. */
    v = REG(PERI_CLK_CTRL02);
    v |= SDIO_LS_SLF_CLK_EN | SDIO_LS_DRV_CLK_EN | SDIO_LS_SAM_CLK_EN;
    v &= ~((3u << SDIO_LS_SLF_EDGE_SEL_S) | (3u << SDIO_LS_DRV_EDGE_SEL_S) |
           (3u << SDIO_LS_SAM_EDGE_SEL_S));
    v |= (1u << SDIO_LS_DRV_EDGE_SEL_S);
    REG(PERI_CLK_CTRL02) = v;
    REG(PERI_CLK_CTRL02) = v | SDIO_LS_EDGE_UPDATE;
    REG(PERI_CLK_CTRL02) = v;

    /* **A divider, before the controller is reset.** MEASURED, 2026-09-18:
     * without this line the very first hardware run printed
     *
     *     [SDMMC] controller reset never completed -- no module clock?
     *
     * and it was telling the truth. The three edge fields reset to zero, and
     * all-zero is NOT "divide by one" -- division by one has its own bit
     * (SDIO_HS_MODE), which is why sdmmc_set_host_div() is documented as
     * taking 2..16 and why IDF's own set_clock_div() branches on div == 1
     * rather than encoding it. All-zero edges with HS_MODE clear is a stopped
     * clock, and a stopped module clock means CTRL's three reset bits are
     * never cleared by hardware, because nothing is clocking the logic that
     * would clear them.
     *
     * So the module needs a working divider before it is reset, not merely
     * before it is used. Two, which is IDF's SDMMC_LL_DEFAULT_DIV at exactly
     * this point in its own bring-up; sdmmc_set_bus_clock() replaces it with
     * the identification-mode value moments later. */
    sdmmc_set_host_div(2);
}

/* --- Commands ------------------------------------------------------------
 *
 * Every command goes through here, including the "command" that is not one:
 * a write to SDHOST_CMD_REG with UPDATE_CLOCK_REGISTERS_ONLY set sends no
 * command to the card at all, it commits the clock registers to the card
 * interface unit. Changing the bus clock means three of them around the
 * writes, which is why it is not a special case below but the ordinary path.
 *
 * START_CMD self-clears when the unit accepts the command, so "has it been
 * taken" is a poll on that bit rather than on an interrupt. */
static int sdmmc_cmd_start(uint32_t cmd, uint32_t arg) {
    uint64_t deadline = time_get_us() + 100000u;      /* 100 ms */

    while (REG(SD_CMD) & CMD_START) {
        if (time_get_us() > deadline) return -1;
    }
    REG(SD_CMDARG) = arg;
    REG(SD_CMD) = cmd | CMD_START | CMD_USE_HOLD_REG;
    while (REG(SD_CMD) & CMD_START) {
        if (time_get_us() > deadline) return -1;
    }
    return 0;
}

static int sdmmc_clock_update(void) {
    return sdmmc_cmd_start(CMD_UPDATE_CLK_ONLY | CMD_WAIT_PRVDATA, 0);
}

/* Sets the card clock as close to `want_khz` as the two dividers allow, and
 * returns what was actually achieved.
 *
 * Two stages, as TRM §57.5 and IDF both describe them: a host divider of
 * 2..16 on PLL_F160M, then the controller's own divider, which divides by
 * 2*n (n = 0 bypasses it). The search below takes the smallest host divider
 * that lets the second stage reach the target, which keeps the intermediate
 * clock high and the quantisation fine: 400 kHz comes out as 160/2/(2*100)
 * and 20 MHz as 160/8 with the second stage bypassed. Both are exact. */
static uint32_t sdmmc_set_bus_clock(uint32_t want_khz) {
    uint32_t want_hz = want_khz * 1000u;
    uint32_t host_div = 2, card_div = 0;

    uint32_t total = (SDMMC_SRC_HZ + want_hz - 1u) / want_hz;
    if (total <= 16u) {
        host_div = (total < 2u) ? 2u : total;
        card_div = 0;
    } else {
        for (uint32_t h = 2; h <= 16u; h++) {
            uint32_t inter = SDMMC_SRC_HZ / h;
            uint32_t c = (inter + 2u * want_hz - 1u) / (2u * want_hz);
            if (c < 1u) c = 1u;
            if (c <= 255u) { host_div = h; card_div = c; break; }
        }
    }

    REG(SD_CLKENA) = 0;
    if (sdmmc_clock_update() != 0) return 0;

    REG(SD_CLKSRC) = 0;                    /* card 0 takes divider 0 */
    REG(SD_CLKDIV) = card_div;
    sdmmc_set_host_div(host_div);
    if (sdmmc_clock_update() != 0) return 0;

    REG(SD_CLKENA) = CLKENA_CCLK_EN_0;
    if (sdmmc_clock_update() != 0) return 0;

    uint32_t real_hz = SDMMC_SRC_HZ / host_div / (card_div ? (2u * card_div) : 1u);

    /* Timeouts, in card-clock cycles, so they follow the clock rather than
     * being a constant that means different things at 400 kHz and 20 MHz.
     * 100 ms of data timeout is what IDF uses and is far longer than any
     * single-block read; the response timeout field is only 8 bits, and 255
     * cycles is generous for a response that must arrive within 64. */
    uint32_t data_timeout = (real_hz / 1000u) * 100u;
    if (data_timeout > 0xffffffu) data_timeout = 0xffffffu;
    REG(SD_TMOUT) = (data_timeout << 8) | 0xffu;

