domschl/LugalOS/drivers/sdmmc_esp32p4.c
    return real_hz / 1000u;
}

/* Resets the controller, the FIFO and the (unused) internal DMA, and waits
 * for the hardware to clear the three bits. Any of them still set after this
 * means the module has no clock -- which is the failure this function exists
 * to turn into a return value rather than a hang. */
static int sdmmc_host_reset(void) {
    REG(SD_CTRL) |= CTRL_RESET | CTRL_FIFO_RESET | CTRL_DMA_RESET;
    uint64_t deadline = time_get_us() + 100000u;
    while (REG(SD_CTRL) & (CTRL_RESET | CTRL_FIFO_RESET | CTRL_DMA_RESET)) {
        if (time_get_us() > deadline) return -1;
    }
    return 0;
}

/* --- The SD protocol on top of it ---------------------------------------
 *
 * The response kinds this driver needs. R7 (CMD8's voltage echo) and R6
 * (CMD3's published address) are both short CRC-checked responses and so
 * share R1's shape; R3 (the OCR, from ACMD41) is the one that must NOT be
 * CRC-checked, because the card does not compute one for it -- asking the
 * controller to check it turns every ACMD41 into an RCRC error. */
typedef enum {
    RESP_NONE = 0,
    RESP_R1,      /* and R6, R7 */
    RESP_R1B,     /* R1 plus the card holding DAT0 low while it works */
    RESP_R2,      /* 136-bit: CID, CSD */
    RESP_R3,      /* OCR, no CRC */
} sd_resp_t;

/* Sends one command and collects its response. Returns 0, or -1 with the raw
 * status left in *out_status for the caller to report -- this function
 * deliberately prints nothing, because its callers know which failures are
 * expected (CMD8 timing out is how an SDv1 card announces itself) and which
 * are not. */
static int sd_command(uint8_t index, uint32_t arg, sd_resp_t rt,
                      uint32_t data_flags, uint32_t *resp, uint32_t *out_status) {
    uint32_t cmd = (uint32_t)index & CMD_INDEX_M;

    switch (rt) {
        case RESP_NONE: break;
        case RESP_R1:
        case RESP_R1B:  cmd |= CMD_RESP_EXPECT | CMD_CHECK_RESP_CRC; break;
        case RESP_R2:   cmd |= CMD_RESP_EXPECT | CMD_RESP_LONG | CMD_CHECK_RESP_CRC; break;
        case RESP_R3:   cmd |= CMD_RESP_EXPECT; break;
    }
    cmd |= data_flags | CMD_WAIT_PRVDATA;

    REG(SD_RINTSTS) = 0xffffffffu;     /* raw status is write-1-to-clear */
    if (sdmmc_cmd_start(cmd, arg) != 0) {
        if (out_status) *out_status = 0;
        return -1;
    }

    uint64_t deadline = time_get_us() + 500000u;
    uint32_t status;
    for (;;) {
        status = REG(SD_RINTSTS);
        if (status & (INT_CMD_DONE | INT_CMD_ERRORS)) break;
        if (time_get_us() > deadline) {
            if (out_status) *out_status = status;
            return -1;
        }
    }
    if (out_status) *out_status = status;
    if (status & INT_CMD_ERRORS) return -1;

    if (resp) {
        if (rt == RESP_R2) {
            /* RESP0 is the LOW word of the 128-bit response, so resp[0] holds
             * CSD/CID bits [31:0] and resp[3] holds [127:96]. That is the
             * order the bit numbers in sd_bits() below assume, and it is the
             * opposite of the convention Linux's MMC core uses -- worth being
             * explicit about, since both are "the obvious one" to someone who
             * has read the other. */
            resp[0] = REG(SD_RESP(0));
            resp[1] = REG(SD_RESP(1));
            resp[2] = REG(SD_RESP(2));
            resp[3] = REG(SD_RESP(3));
        } else if (rt != RESP_NONE) {
            resp[0] = REG(SD_RESP(0));
        }
    }

    if (rt == RESP_R1B) {
        /* The card pulls DAT0 low while it finishes. Busy-polled rather than
         * yielded: this is CMD7 during init and nothing else. */
        deadline = time_get_us() + 1000000u;
        while (REG(SD_STATUS) & STATUS_DATA_BUSY) {
            if (time_get_us() > deadline) return -1;
        }
    }
    return 0;
}

/* An application command: CMD55 with the card's address, then the ACMD. */
static int sd_acommand(uint8_t index, uint32_t arg, sd_resp_t rt,
                       uint32_t *resp, uint32_t *out_status) {
    if (sd_command(55, g_rca << 16, RESP_R1, 0, NULL, out_status) != 0) return -1;
    return sd_command(index, arg, rt, 0, resp, out_status);
}

/* Bit field out of a 128-bit response, numbered the way the SD spec numbers
 * the CSD -- bit 0 is the low bit of resp[0], which is where the CRC lives,
 * and CSD_STRUCTURE is at 126. Same arithmetic as IDF's MMC_RSP_BITS(); the
 * field positions below are the spec's and IDF's alike. */
static uint32_t sd_bits(const uint32_t *r, uint32_t start, uint32_t len) {
    uint32_t mask = (len % 32u == 0u) ? 0xffffffffu : (0xffffffffu >> (32u - (len % 32u)));
    uint32_t word = start / 32u;
    uint32_t shift = start % 32u;
    if (word > 3u) return 0;
    uint32_t right = r[word] >> shift;
    uint32_t left = (len + shift <= 32u || word >= 3u) ? 0u : (r[word + 1u] << ((32u - shift) % 32u));
    return (left | right) & mask;
}

/* Capacity in 512-byte blocks, which is what block_dev_t wants.
 *
 * Two CSD layouts, and the difference is not cosmetic: a v2 CSD (every SDHC
 * and SDXC card) states the capacity directly in 512 KB units, while a v1 one
 * states it as a count of blocks whose size the card also chooses -- a 1 GB
 * card with READ_BL_LEN 10 reports half as many blocks of twice the size, so
 * the last step below is a conversion, not a rounding. Returns 0 for a CSD
 * version this driver does not know, which is an honest "no capacity" rather
 * than a plausible wrong number. */
static uint32_t sd_csd_blocks(const uint32_t *csd) {
    uint32_t ver = sd_bits(csd, 126, 2);
    if (ver == 1u) {
        return (sd_bits(csd, 48, 22) + 1u) << 10;
    }
    if (ver == 0u) {
        uint32_t c_size = sd_bits(csd, 62, 12);
        uint32_t c_mult = sd_bits(csd, 47, 3);
        uint32_t bl_len = sd_bits(csd, 80, 4);
        uint32_t blocks = (c_size + 1u) << (c_mult + 2u);
        if (bl_len > 9u) blocks <<= (bl_len - 9u);   /* into 512-byte units */
        return blocks;
    }
    return 0;
}

/* --- Data transfers ------------------------------------------------------
 *
 * Through the controller's own DMA, and **not** through the CPU FIFO path the
 * TRM documents. That is a correction, and it is the expensive finding of this
 * phase, so it is recorded here rather than in a commit message.
 *
 * TRM §57.6 says a block can be moved by reading SDHOST_BUFFIFO_REG, and
 * §57.9.2 step 7 repeats it. **On this silicon that read never pops the
 * FIFO.** Measured on the bench, 2026-09-18, on a card that was otherwise
 * working perfectly:
 *
 *   - CMD17 completed, DATA_OVER was set, no error bit anywhere.
 *   - STATUS.fifo_count read 128 -- exactly one block of 32-bit words, so the
 *     data had arrived in the FIFO.
 *   - Reading SDHOST_BUFFIFO_REG 128 times returned the *same* word 128 times
 *     (the block's real first word, 0x6d9058eb), and fifo_count stayed at 128
 *     afterwards. Reading through the rest of the 0x200-0x7FF window behaved
 *     identically. Console output between reads rules out any load merging.
 *   - The write side is fine: fifo_reset takes the count to 0, and reading
 *     block 1 afterwards puts *that* block's first word at the head
 *     (0x41615252, "RRaA" -- the FAT32 FSInfo signature, which is exactly what
 *     sector 1 of this card should contain).
 *   - Setting RX_WMARK to 0, so the FIFO request is raised continuously,
 *     changed nothing.
 *
 * So the FIFO's read port simply is not wired to the CPU here, whatever the
 * TRM says. ESP-IDF's agreement is retrospective evidence: its SDMMC driver
 * has only ever used the IDMAC, on every ESP32 part, with no FIFO-mode branch
 * to fall back to. This is the same class of error the project already
 * recorded for this chip's UART, where the TRM describes TXFIFO_CNT as an RX
 * count -- the register diagrams are reliable, the prose around them is not.
 *
 * What that costs, and how it is paid:
 *
 *   - **A descriptor**, padded to a full 64-byte cache line for the reason
 *     drivers/emac_esp32p4.c gives for its rings: the CPU and the DMA both
 *     write it, so it needs cache maintenance, and an invalidate discards a
 *     whole line.
 *   - **A bounce buffer**, because cache maintenance on a caller's buffer is
 *     only safe when that buffer is cache-line aligned and a whole number of
 *     lines long, and a `block_dev_t` caller promises neither. Invalidating a
 *     partial line would discard whatever else shares it. 512 bytes and one
 *     memcpy per block is the price of not having that bug.
 *
 * Multi-block is still deliberately absent -- see the phase plan's §5. The
 * descriptor below would extend to it by growing into a small ring.
 */

/* DES0, TRM Table 57.8-1. */
#define DESC_OWN            (1u << 31)   /* 1 = the DMA's, 0 = the CPU's */
#define DESC_CH             (1u << 4)    /* DES3 is the next descriptor */
#define DESC_FS             (1u << 3)    /* first descriptor of a transfer */
#define DESC_LD             (1u << 2)    /* last descriptor of a transfer */
#define DESC_DIC            (1u << 1)    /* no interrupt on completion */

