domschl/LugalOS/drivers/sdmmc_esp32p4.c
typedef struct {
    volatile uint32_t des0;
    volatile uint32_t des1;   /* buffer sizes: [12:0] and [25:13] */
    volatile uint32_t des2;   /* buffer 1 address */
    volatile uint32_t des3;   /* chained: the next descriptor's address */
    uint32_t pad[12];         /* one descriptor per cache line, see above */
} sdmmc_desc_t;

static sdmmc_desc_t g_desc  __attribute__((aligned(ESP32P4_L1_CACHE_LINE)));
static uint8_t g_dma_buf[512] __attribute__((aligned(ESP32P4_L1_CACHE_LINE)));

static uint32_t sdmmc_fifo_count(void) {
    return (REG(SD_STATUS) >> STATUS_FIFO_COUNT_S) & STATUS_FIFO_COUNT_M;
}

/* Arms the IDMAC on the bounce buffer for one 512-byte transfer. The caller
 * has already put the data there (a write) or is about to read it out (a
 * read); this only hands the buffer over. */
static void sdmmc_dma_arm(void) {
    /* The bounded wait below reports nothing if it expires, and that is
     * deliberate: the only way these bits stay set is a module with no clock,
     * which sdmmc_host_init() has already refused to proceed past. If one
     * ever did hang here, the transfer that follows fails and says so with
     * both status registers in hand, which is a better message than this
     * function could write. */
    REG(SD_CTRL) |= CTRL_DMA_RESET | CTRL_FIFO_RESET;
    uint64_t deadline = time_get_us() + 10000u;
    while ((REG(SD_CTRL) & (CTRL_DMA_RESET | CTRL_FIFO_RESET)) &&
           time_get_us() < deadline) { }

    REG(SD_BMOD) = BMOD_SWR;
    REG(SD_IDSTS) = 0xffffffffu;      /* write-1-to-clear, like RINTSTS */
    REG(SD_IDINTEN) = 0;              /* polled; nothing reaches the CLIC */

    g_desc.des0 = DESC_OWN | DESC_CH | DESC_FS | DESC_LD | DESC_DIC;
    g_desc.des1 = 512u;
    g_desc.des2 = (uint32_t)(uintptr_t)g_dma_buf;
    g_desc.des3 = (uint32_t)(uintptr_t)&g_desc;   /* chained back to itself */
    esp32p4_dcache_writeback((uintptr_t)&g_desc, sizeof(g_desc));

    REG(SD_CTRL) |= CTRL_DMA_ENABLE | CTRL_USE_INTERNAL_DMA;
    REG(SD_DBADDR) = (uint32_t)(uintptr_t)&g_desc;
    REG(SD_BMOD) = BMOD_DE | BMOD_FB;
    REG(SD_PLDMND) = 1;

    REG(SD_BLKSIZ) = 512;
    REG(SD_BYTCNT) = 512;
}

/* Waits for the data phase and reports what went wrong if it did. Both status
 * registers matter: RINTSTS carries the card-facing errors (CRC, timeouts)
 * and IDSTS the bus-facing ones (a descriptor the DMA could not fetch, a bus
 * error), and a transfer can fail in either without the other noticing. */
static int sdmmc_dma_wait(uint32_t lba, const char *what) {
    uint64_t deadline = time_get_us() + 500000u;
    for (;;) {
        uint32_t st = REG(SD_RINTSTS);
        uint32_t id = REG(SD_IDSTS);
        if ((st & INT_DATA_ERRORS) || (id & IDSTS_ERRORS)) {
            printk("[SDMMC] %s lba %u failed (RINTSTS 0x%x IDSTS 0x%x)\n",
                   what, (unsigned)lba, (unsigned)st, (unsigned)id);
            return -1;
        }
        if (st & INT_DATA_OVER) return 0;
        if (time_get_us() > deadline) {
            printk("[SDMMC] %s lba %u timed out (RINTSTS 0x%x IDSTS 0x%x FIFO %u)\n",
                   what, (unsigned)lba, (unsigned)st, (unsigned)id,
                   (unsigned)sdmmc_fifo_count());
            return -1;
        }
    }
}

static int sdmmc_hw_read_block(uint32_t lba, uint8_t *dst) {
    /* Invalidate before handing the buffer over, not only after: the CPU may
     * hold dirty lines over it from the last transfer, and a writeback landing
     * after the DMA has filled it would overwrite the card's data with stale
     * bytes. drivers/emac_esp32p4.c's receive ring makes the same argument. */
    esp32p4_dcache_invalidate((uintptr_t)g_dma_buf, sizeof(g_dma_buf));
    sdmmc_dma_arm();

    uint32_t addr = g_block_addressed ? lba : (lba * 512u);
    uint32_t status = 0;
    if (sd_command(17, addr, RESP_R1, CMD_DATA_EXPECTED, NULL, &status) != 0) {
        printk("[SDMMC] CMD17 lba %u failed (status 0x%x)\n",
               (unsigned)lba, (unsigned)status);
        return -1;
    }
    if (sdmmc_dma_wait(lba, "read") != 0) return -1;

    esp32p4_dcache_invalidate((uintptr_t)g_dma_buf, sizeof(g_dma_buf));
    memcpy(dst, g_dma_buf, 512);
    return 0;
}

static int sdmmc_hw_write_block(uint32_t lba, const uint8_t *src) {
    memcpy(g_dma_buf, src, 512);
    esp32p4_dcache_writeback((uintptr_t)g_dma_buf, sizeof(g_dma_buf));
    sdmmc_dma_arm();

    uint32_t addr = g_block_addressed ? lba : (lba * 512u);
    uint32_t status = 0;
    if (sd_command(24, addr, RESP_R1, CMD_DATA_EXPECTED | CMD_WRITE, NULL, &status) != 0) {
        printk("[SDMMC] CMD24 lba %u failed (status 0x%x)\n",
               (unsigned)lba, (unsigned)status);
        return -1;
    }
    if (sdmmc_dma_wait(lba, "write") != 0) return -1;

    /* The card programs its flash with DAT0 held low, and may hold it for
     * milliseconds. Busy-polled, like the RP2350 driver's own write path:
     * yielding here would mean a serve callback rescheduling inside a
     * transfer, and the block driver's contract is that only it touches the
     * hardware while one is in flight. */
    uint64_t deadline = time_get_us() + 1000000u;
    while (REG(SD_STATUS) & STATUS_DATA_BUSY) {
        if (time_get_us() > deadline) {
            printk("[SDMMC] write lba %u: card still busy after 1 s\n", (unsigned)lba);
            return -1;
        }
    }
    return 0;
}

/* --- Bringing a card up --------------------------------------------------
 *
 * The host half (power, pads, clocks, controller reset) is idempotent and is
 * done once; the card half runs again on every probe, because a slot is
 * allowed to be empty at boot and full later.
 *
 * An empty slot is cheap to discover and that is deliberate: CMD8 and then
 * CMD55 both come back as response timeouts within a few dozen card clocks,
 * so the whole probe costs microseconds rather than the 1.5 s the ACMD41 loop
 * is budgeted. The budget only ever applies to a card that is answering and
 * still initialising. */
static bool g_hw_ready;

static void sdmmc_host_init(void) {
    if (g_hw_ready) return;

