domschl/LugalOS/drivers/sdmmc_esp32p4.c
    sdmmc_power_on();
    sdmmc_pads_init();
    sdmmc_clk_init();

    if (sdmmc_host_reset() != 0) {
        printk("[SDMMC] controller reset never completed -- no module clock?\n");
        return;
    }

    /* Polled, start to finish: no interrupt is routed, INTMASK stays clear so
     * nothing reaches the interrupt controller, and RINTSTS (which is raw and
     * set regardless) is what this driver reads. The EMAC made the same call
     * for the same reason -- see plan/phase28's Z6. */
    REG(SD_INTMASK) = 0;
    REG(SD_CTRL) &= ~CTRL_INT_ENABLE;
    REG(SD_RINTSTS) = 0xffffffffu;

    /* The internal DMA, explicitly off. BMOD.DE is the only enable it has on
     * this chip -- SDHOST_CTRL_REG here has no USE_INTERNAL_DMA bit at all,
     * unlike the S3's -- so clearing BMOD is what selects the CPU path. */
    REG(SD_BMOD) = 0;

    /* FIFO watermarks: the half-depth values, and a note about how much they
     * matter. They decide when the IDMAC is asked to move data mid-transfer;
     * a transfer also moves at end of packet "regardless of threshold
     * programming" (the TRM's own words on SDHOST_RX_WMARK), which is why a
     * 128-word block completes whatever these say. IDF never writes this
     * register at all, leaving it at its reset value of 0 -- so these are a
     * considered choice rather than a copied one, exercised at 20 MHz on real
     * transfers. If a multi-block path ever lands (phase plan §5) this is one
     * of the first registers to revisit, because there the mid-transfer
     * behaviour is the whole game. */
    REG(SD_FIFOTH) = (255u << 16) | 256u;

    /* The card's reset output, which the NANO does not wire to anything --
     * the socket has no reset pin. Left released, which is its reset value. */
    REG(SD_RST_N) |= RST_N_CARD_RESET_0;

    REG(SD_CTYPE) = 0;                       /* 1-bit until ACMD6 says otherwise */
    g_bus_width = 1;
    g_bus_khz = sdmmc_set_bus_clock(400);    /* identification mode */
    g_hw_ready = true;
}

/* Switches the bus to 4 bits and proves it, or stays at 1.
 *
 * The proof is a read of block 0 at the final clock, and it is the only
 * honest way to make this claim: ACMD6 returns R1 with no error whether or
 * not the data lines are actually connected, so a driver that trusts the
 * response reports a 4-bit bus and then fails on its first real read. D1 and
 * D2 in particular do nothing at all in 1-bit mode, so nothing before this
 * point has ever driven them.
 *
 * `probe` is 512 bytes of .bss rather than a local because this runs on
 * whatever stack the first caller happens to have -- vfs_server_init()'s,
 * during boot -- and half a kilobyte is a great deal to ask of one. */
static uint8_t g_probe_block[512];

static void sdmmc_set_bus_width(void) {
    uint32_t want = (uint32_t)CONFIG_SDMMC_BUS_WIDTH;
    uint32_t status = 0;

    if (want == 4u) {
        if (sd_acommand(6, 2, RESP_R1, NULL, &status) == 0) {
            REG(SD_CTYPE) = CTYPE_WIDTH4_0;
            g_bus_width = 4;
        } else {
            printk("[SDMMC] ACMD6 refused 4-bit (status 0x%x); staying 1-bit\n",
                   (unsigned)status);
        }
    }

    g_bus_khz = sdmmc_set_bus_clock((uint32_t)CONFIG_SDMMC_FREQ_KHZ);

    if (sdmmc_hw_read_block(0, g_probe_block) == 0) return;

    if (g_bus_width == 4u) {
        printk("[SDMMC] 4-bit bus did not read back; falling back to 1-bit\n");
        if (sd_acommand(6, 0, RESP_R1, NULL, &status) == 0) {
            REG(SD_CTYPE) = 0;
            g_bus_width = 1;
            if (sdmmc_hw_read_block(0, g_probe_block) == 0) return;
        }
    }

    /* Neither width could read block 0 at the target clock. Say so and leave
     * the card marked present anyway: the filesystem mount below will fail
     * next and report it in the ordinary way, which is a better error than a
     * card that silently is not there. */
    printk("[SDMMC] block 0 unreadable at %u kHz, %u-bit\n",
           (unsigned)g_bus_khz, (unsigned)g_bus_width);
}

static int sdmmc_card_init(void) {
    uint32_t resp[4] = {0, 0, 0, 0};
    uint32_t status = 0;

    sdmmc_host_init();
    if (!g_hw_ready) return -1;

    g_present = false;
    g_block_addressed = false;
    g_rca = 0;
    g_blocks = 0;

    /* Back to identification mode for the retry case: a second probe on a
     * card that was already initialised must start where the first one did. */
    REG(SD_CTYPE) = 0;
    g_bus_width = 1;
    g_bus_khz = sdmmc_set_bus_clock(400);

    /* CMD0 with SEND_INITIALIZATION, which is the controller sending the 80
     * clocks the spec requires before the first command rather than this
     * driver bit-banging them. */
    if (sd_command(0, 0, RESP_NONE, CMD_SEND_INIT, NULL, &status) != 0) {
        printk("[SDMMC] CMD0 was not accepted (status 0x%x)\n", (unsigned)status);
        return -1;
    }

    /* CMD8: does the card understand SD 2.0's argument, and does it echo the
     * check pattern back? A timeout here is not an error -- it is how an SDv1
     * card answers -- so it is not reported as one. */
    bool v2 = false;
    if (sd_command(8, 0x1AAu, RESP_R1, 0, resp, &status) == 0 &&
        (resp[0] & 0xffu) == 0xAAu) {
        v2 = true;
    }

    /* ACMD41 until the card leaves idle. Bounded by the clock, not by a retry
     * count, for the reason drivers/spisd_rp2350.c gives at length: the SD
     * spec's budget is one second, iterations are not seconds, and the
     * substitution silently changes meaning when the clock moves. */
    uint32_t ocr = 0;
    uint64_t deadline = time_get_ms() + 1500u;
    unsigned tries = 0;
    for (;;) {
        uint32_t arg = 0x00FF8000u | (v2 ? 0x40000000u : 0u);  /* 2.7-3.6 V, HCS */
        if (sd_acommand(41, arg, RESP_R3, resp, &status) != 0) {
            if (tries == 0) {
                /* The ordinary empty-slot path. Not an error line: `sdinfo`
                 * and the mount message both say "no card" perfectly well. */
                return -1;
            }
            printk("[SDMMC] ACMD41 stopped answering after %u tries (status 0x%x)\n",
                   tries, (unsigned)status);
            return -1;
        }
        tries++;
        ocr = resp[0];
        if (ocr & 0x80000000u) break;        /* card is no longer busy */
        if (time_get_ms() > deadline) {
            printk("[SDMMC] ACMD41 did not leave idle within 1500 ms "
                   "(OCR 0x%x, %u tries, card is %s)\n",
                   (unsigned)ocr, tries, v2 ? "SDv2/SDHC" : "SDv1");
            return -1;
        }
    }
    g_block_addressed = v2 && (ocr & 0x40000000u) != 0u;   /* OCR's CCS bit */

    /* CMD2: the CID, which is what `sdinfo` prints. CMD3: the card publishes
     * an address for everything after this point to use. */
    if (sd_command(2, 0, RESP_R2, 0, g_cid, &status) != 0) {
        printk("[SDMMC] CMD2 (CID) failed (status 0x%x)\n", (unsigned)status);
        return -1;
    }
    if (sd_command(3, 0, RESP_R1, 0, resp, &status) != 0) {
        printk("[SDMMC] CMD3 (publish RCA) failed (status 0x%x)\n", (unsigned)status);
        return -1;
    }
    g_rca = resp[0] >> 16;

