domschl/LugalOS/drivers/sdmmc_esp32p4.c
    /* CMD9: the CSD, and with it the real capacity. Must be asked while the
     * card is still deselected -- CMD9 is a stand-by-state command. */
    if (sd_command(9, g_rca << 16, RESP_R2, 0, resp, &status) != 0) {
        printk("[SDMMC] CMD9 (CSD) failed (status 0x%x)\n", (unsigned)status);
        return -1;
    }
    g_blocks = sd_csd_blocks(resp);
    if (g_blocks == 0) {
        printk("[SDMMC] CSD structure %u not understood; capacity unknown\n",
               (unsigned)sd_bits(resp, 126, 2));
        return -1;
    }

    /* CMD7: select it. R1b -- the card may hold the bus while it switches. */
    if (sd_command(7, g_rca << 16, RESP_R1B, 0, NULL, &status) != 0) {
        printk("[SDMMC] CMD7 (select) failed (status 0x%x)\n", (unsigned)status);
        return -1;
    }

    /* CMD16: 512-byte blocks. A block-addressed card is fixed at 512 already
     * and ignores this; a byte-addressed one needs it, and sending it to both
     * is one less state to reason about than sending it to one. */
    if (sd_command(16, 512, RESP_R1, 0, NULL, &status) != 0) {
        printk("[SDMMC] CMD16 (512-byte blocks) failed (status 0x%x)\n", (unsigned)status);
        return -1;
    }

    sdmmc_set_bus_width();

    g_present = true;
    printk("[SDMMC] MicroSD %u MB (%s, %u-bit, %u kHz) on SDMMC slot 0 "
           "(CLK=GPIO%d CMD=GPIO%d D0-D3=GPIO%d-%d)\n",
           (unsigned)(g_blocks / 2048u),
           g_block_addressed ? "SDHC/SDXC block-addressed" : "SD byte-addressed",
           (unsigned)g_bus_width, (unsigned)g_bus_khz,
           CONFIG_SDMMC_CLK_GPIO, CONFIG_SDMMC_CMD_GPIO,
           CONFIG_SDMMC_D0_GPIO, CONFIG_SDMMC_D3_GPIO);
    return 0;
}

/* --- The "sdblk" driver task --------------------------------------------
 *
 * The same endpoint name, wire protocol and four-block batch as
 * drivers/spisd_rp2350.c's and drivers/virtio_blk.c's, deliberately: /proc,
 * `blkstats` and the hardware tests all ask the same questions of whichever
 * of the three a board happens to build, and a third dialect would mean a
 * third case in each of them.
 *
 * Kernel-mode, not U-mode, and that is the one difference worth stating.
 * spisd's task drops to U-mode under a PMP domain covering SIO and SPI1;
 * this one does not, because on this board nothing else does yet -- the P4
 * has no .utext region wired up and no driver running under a domain, so a
 * single driver claiming isolation here would be claiming something no test
 * on this board can check. drivers/driver_task.h's own warning applies:
 * real isolation or a kernel-mode task, and it is a choice. */
#define BLK_REQ_READ  ((uint8_t)'R')
#define BLK_REQ_WRITE ((uint8_t)'W')
#define BLK_MAX_COUNT 4u
#define BLK_HDR_LEN   9u /* opcode + lba(4) + count(4) */
#define BLK_REQ_CAP   (BLK_HDR_LEN + BLK_MAX_COUNT * 512u)
#define BLK_RESP_CAP  (1u + BLK_MAX_COUNT * 512u)

static uint8_t       g_blk_req[BLK_REQ_CAP];
static uint8_t       g_blk_resp[BLK_RESP_CAP];
static driver_task_t g_blk_task;

uint32_t blk_task_call_count(void) { return driver_task_call_count(&g_blk_task); }

static bool blk_task_alive(void) { return driver_task_alive(&g_blk_task); }

static uint32_t be32_load(const uint8_t *p) {
    return ((uint32_t)p[0] << 24) | ((uint32_t)p[1] << 16) | ((uint32_t)p[2] << 8) | p[3];
}

static void be32_store(uint8_t *p, uint32_t v) {
    p[0] = (uint8_t)(v >> 24); p[1] = (uint8_t)(v >> 16);
    p[2] = (uint8_t)(v >> 8);  p[3] = (uint8_t)v;
}

static int sdmmc_hw_read_blocks(uint32_t lba, uint32_t count, uint8_t *dst) {
    if (!g_present) return -1;
    for (uint32_t i = 0; i < count; i++) {
        if (sdmmc_hw_read_block(lba + i, dst + (size_t)i * 512u) != 0) return -1;
    }
    return 0;
}

static int sdmmc_hw_write_blocks(uint32_t lba, uint32_t count, const uint8_t *src) {
    if (!g_present) return -1;
    for (uint32_t i = 0; i < count; i++) {
        if (sdmmc_hw_write_block(lba + i, src + (size_t)i * 512u) != 0) return -1;
    }
    return 0;
}

/* This callback, and only this callback, touches the controller while the
 * task is alive. drivers/driver_task.h's three invariants are what it runs
 * under; the framework owns the loop, and what is left here is the wire
 * protocol, which is this driver's. */
static uint32_t blk_serve(void *ctx, const uint8_t *req, uint32_t req_len,
                          uint8_t *resp, uint32_t resp_cap) {
    (void)ctx; (void)resp_cap;

    uint8_t  op    = req[0];
    uint32_t lba   = be32_load(&req[1]);
    uint32_t count = be32_load(&req[5]);

    if (op == BLK_REQ_READ && count >= 1 && count <= BLK_MAX_COUNT) {
        int rc = sdmmc_hw_read_blocks(lba, count, &resp[1]);
        resp[0] = (rc == 0) ? 0 : 1;
        return (rc == 0) ? (1u + count * 512u) : 1u;
    }
    if (op == BLK_REQ_WRITE && count >= 1 && count <= BLK_MAX_COUNT &&
        req_len >= BLK_HDR_LEN + count * 512u) {
        int rc = sdmmc_hw_write_blocks(lba, count, &req[BLK_HDR_LEN]);
        resp[0] = (rc == 0) ? 0 : 1;
        return 1;
    }
    resp[0] = 1;
    return 1;
}

int sdmmc_task_start(void) {
    if (!g_present) return -1;         /* nothing to serve */
    const driver_task_spec_t spec = {
        .name        = "sdblk",
        .serve       = blk_serve,
        .ctx         = NULL,
        .req         = g_blk_req,  .req_cap  = sizeof(g_blk_req),
        .resp        = g_blk_resp, .resp_cap = sizeof(g_blk_resp),
        .min_req_len = BLK_HDR_LEN,
        .stack_pages = 1,
        .priority    = DRIVER_PRIO_DEFAULT,
    };
    return driver_task_start(&g_blk_task, &spec);
}

/* One batched request through the endpoint. Returns the blocks transferred,
 * or -1 if the channel itself failed -- which the caller answers by falling
 * back to direct access rather than by propagating a failure that might be
 * about the IPC and not about the card. Same split, and the same reasoning,
 * as spisd's and virtio_blk's. */
static int blk_read_chunk(uint32_t lba, uint32_t count, uint8_t *dst) {
    uint8_t req[BLK_HDR_LEN];
    req[0] = BLK_REQ_READ;
    be32_store(&req[1], lba);
    be32_store(&req[5], count);
    uint8_t resp[BLK_RESP_CAP];
    int n = driver_task_call(&g_blk_task, req, sizeof(req), resp, sizeof(resp));
    if (n >= 1 && resp[0] == 0 && (uint32_t)n >= 1u + count * 512u) {
        memcpy(dst, &resp[1], count * 512u);
        return (int)count;
    }
    return -1;
}

static int blk_write_chunk(uint32_t lba, uint32_t count, const uint8_t *src) {
    uint8_t req[BLK_REQ_CAP];
    req[0] = BLK_REQ_WRITE;
    be32_store(&req[1], lba);
    be32_store(&req[5], count);
    memcpy(&req[BLK_HDR_LEN], src, count * 512u);
    uint8_t resp[1];
    int n = driver_task_call(&g_blk_task, req, BLK_HDR_LEN + count * 512u,
                             resp, sizeof(resp));
    if (n >= 1 && resp[0] == 0) return (int)count;
    return -1;
}

