domschl/LugalOS/drivers/sdmmc_esp32p4.c
static int sdmmc_read_blocks(block_dev_t *dev, void *buf, uint32_t lba, uint32_t count) {
    if (!buf || count == 0 || lba + count < lba || lba + count > dev->num_blocks) return -1;

    uint32_t done = 0;
    uint8_t *dst = (uint8_t *)buf;
    if (blk_task_alive()) {
        while (done < count) {
            uint32_t chunk = (count - done) > BLK_MAX_COUNT ? BLK_MAX_COUNT : (count - done);
            int n = blk_read_chunk(lba + done, chunk, dst + (size_t)done * 512u);
            if (n < 0) break;
            done += (uint32_t)n;
        }
        if (done >= count) return 0;
    }
    return sdmmc_hw_read_blocks(lba + done, count - done, dst + (size_t)done * 512u);
}

static int sdmmc_write_blocks(block_dev_t *dev, const void *buf, uint32_t lba, uint32_t count) {
    if (!buf || count == 0 || lba + count < lba || lba + count > dev->num_blocks) return -1;

    uint32_t done = 0;
    const uint8_t *src = (const uint8_t *)buf;
    if (blk_task_alive()) {
        while (done < count) {
            uint32_t chunk = (count - done) > BLK_MAX_COUNT ? BLK_MAX_COUNT : (count - done);
            int n = blk_write_chunk(lba + done, chunk, src + (size_t)done * 512u);
            if (n < 0) break;
            done += (uint32_t)n;
        }
        if (done >= count) return 0;
    }
    return sdmmc_hw_write_blocks(lba + done, count - done, src + (size_t)done * 512u);
}

static block_dev_t g_sdmmc_dev = {
    .name = "sdmmc0",
    .block_size = 512,
    .num_blocks = 0,          /* the CSD's number, filled in by the probe */
    .read_blocks = sdmmc_read_blocks,
    .write_blocks = sdmmc_write_blocks,
};

block_dev_t *sdmmc_get_device(void) {
    if (!g_present) {
        if (sdmmc_card_init() != 0) return NULL;
        g_sdmmc_dev.num_blocks = g_blocks;
    }
    return &g_sdmmc_dev;
}

/* --- `sdinfo` and `sdbench` ---------------------------------------------- */

/* Sequential read throughput, measured on the board's own clock.
 *
 * A rate without a sample size is not a measurement, so this reads a whole
 * megabyte by default rather than timing one block, and it prints the count it
 * actually achieved. Read-only and bounded: it walks from LBA 0, which on a
 * mounted volume is the filesystem's own metadata, and writes nothing.
 *
 * It goes through block_dev_t rather than sdmmc_hw_read_block(), deliberately:
 * what matters is the rate a filesystem sees, which includes the sdblk task's
 * IPC and its four-block batching, not the rate the bus could manage with
 * nothing in the way. */
void sdmmc_bench_report(uint32_t kilobytes) {
    block_dev_t *dev = sdmmc_get_device();
    if (!dev) {
        cprintf("sdbench: no card\n");
        return;
    }
    if (kilobytes == 0 || kilobytes > 8192u) kilobytes = 1024u;

    uint32_t blocks = kilobytes * 2u;
    if (blocks > dev->num_blocks) blocks = dev->num_blocks;

    static uint8_t buf[512 * 4];
    uint32_t done = 0;
    uint64_t t0 = time_get_us();
    while (done < blocks) {
        uint32_t chunk = (blocks - done) > 4u ? 4u : (blocks - done);
        if (dev->read_blocks(dev, buf, done, chunk) != 0) {
            cprintf("sdbench: read failed at lba %u\n", (unsigned)done);
            return;
        }
        done += chunk;
    }
    uint64_t us = time_get_us() - t0;
    if (us == 0) us = 1;

    uint32_t kb = done / 2u;
    uint32_t kb_per_s = (uint32_t)(((uint64_t)kb * 1000000u) / us);
    cprintf("sdbench: %u KB in %u ms = %u KB/s (%u-bit at %u kHz, %u blocks, "
            "4 per request)\n",
            (unsigned)kb, (unsigned)(us / 1000u), (unsigned)kb_per_s,
            (unsigned)g_bus_width, (unsigned)g_bus_khz, (unsigned)done);
}



void sdmmc_info_report(void) {
    if (!g_present) {
        /* Probe rather than report a stale "no card": the slot may have been
         * filled since boot, and a command that answers "no" without looking
         * is worth less than the second it takes to look. */
        (void)sdmmc_get_device();
    }
    if (!g_present) {
        cprintf("SDMMC slot 0: no card (CLK=GPIO%d CMD=GPIO%d D0-D3=GPIO%d-%d, "
                "rail VO4 %s)\n",
                CONFIG_SDMMC_CLK_GPIO, CONFIG_SDMMC_CMD_GPIO,
                CONFIG_SDMMC_D0_GPIO, CONFIG_SDMMC_D3_GPIO,
                (REG(PMU_EXT_LDO_VO4) & LDO_XPD) ? "on" : "OFF");
        return;
    }

    char pnm[6];
    for (int i = 0; i < 5; i++) {
        pnm[i] = (char)sd_bits(g_cid, (uint32_t)(96 - 8 * i), 8);
        if (pnm[i] < 0x20 || pnm[i] > 0x7e) pnm[i] = '?';
    }
    pnm[5] = '\0';

    uint32_t mdt = sd_bits(g_cid, 8, 12);
    cprintf("SDMMC slot 0: %s, %u MB (%u blocks of 512 B)\n",
            g_block_addressed ? "SDHC/SDXC" : "SD", (unsigned)(g_blocks / 2048u),
            (unsigned)g_blocks);
    cprintf("  card   MID 0x%02x OID '%c%c' name '%s' rev %u.%u serial 0x%08x %u/%u\n",
            (unsigned)sd_bits(g_cid, 120, 8),
            (char)sd_bits(g_cid, 112, 8), (char)sd_bits(g_cid, 104, 8), pnm,
            (unsigned)sd_bits(g_cid, 60, 4), (unsigned)sd_bits(g_cid, 56, 4),
            (unsigned)sd_bits(g_cid, 24, 32),
            (unsigned)(mdt & 0xfu), (unsigned)(2000u + (mdt >> 4)));
    cprintf("  bus    %u-bit at %u kHz, RCA 0x%04x, addressing %s\n",
            (unsigned)g_bus_width, (unsigned)g_bus_khz, (unsigned)g_rca,
            g_block_addressed ? "block" : "byte");
    cprintf("  host   CDETECT 0x%x WRTPRT 0x%x STATUS 0x%x, sdblk task %s "
            "(%u calls)\n",
            (unsigned)REG(SD_CDETECT), (unsigned)REG(SD_WRTPRT),
            (unsigned)REG(SD_STATUS),
            blk_task_alive() ? "serving" : "not running",
            (unsigned)blk_task_call_count());

    /* Block 0, re-read now, and the reason this is in a status command rather
     * than in a debugging patch somebody deleted afterwards: "the card
     * answered but /sd0 did not mount" has two very different causes -- a
     * card with no filesystem on it, and a data path returning the wrong
     * bytes -- and they are indistinguishable from every other line above.
     * Sixteen bytes and the signature separate them: a blank card reads as
     * zeros or 0xff with no 55 aa, and a broken path reads as neither. */
    if (sdmmc_hw_read_block(0, g_probe_block) != 0) {
        cprintf("  block0 UNREADABLE\n");
        return;
    }
    cprintf("  block0 ");
    for (int i = 0; i < 16; i++) cprintf("%02x ", g_probe_block[i]);
    cprintf("... sig %02x %02x %s\n",
            g_probe_block[510], g_probe_block[511],
            (g_probe_block[510] == 0x55 && g_probe_block[511] == 0xAA)
                ? "(MBR/VBR)" : "(no boot signature)");

}

#else /* !CONFIG_ENABLE_SDMMC */

block_dev_t *sdmmc_get_device(void) { return NULL; }
int sdmmc_task_start(void) { return -1; }
uint32_t blk_task_call_count(void) { return 0; }
void sdmmc_info_report(void) {
    cprintf("SDMMC: built out of this image (LUGALOS_ENABLE_SDMMC=OFF)\n");
}
void sdmmc_bench_report(uint32_t kilobytes) { (void)kilobytes; sdmmc_info_report(); }

#endif /* CONFIG_ENABLE_SDMMC */
